---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.MaterialType
source: html/866dd039-e888-66fb-d844-c99b2b14a11f.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.MaterialType Property

Get the material type information which this temperature rating type belongs to.

## Syntax (C#)
```csharp
public WireMaterialType MaterialType { get; }
```